[Survived] Regex
main/components/Articles/ArticlesForm.js:20:27
    
     const navigate = useNavigate();
 
-    const isodate_regex = /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
+    const isodate_regex = /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\DT[0-2]\d:[0-5]\d)/i;
     // const email_regex = /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/;
 

[Survived] Regex
main/components/Articles/ArticlesForm.js:20:27
    
     const navigate = useNavigate();
 
-    const isodate_regex = /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
+    const isodate_regex = /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
     // const email_regex = /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/;
 

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:50:43
                     id="title"
                     type="text"
                     isInvalid={Boolean(errors.title)}
-                    {...register("title", {
-                        required: "Title is required.",
-                        maxLength : {
-                            value: 30,
-                            message: "Max length 30 characters"
-                        }
-                    })}
+                    {...register("title", {})}
                 />
                 <Form.Control.Feedback type="invalid">
statusReason: Error: Unable to find an element with the text: /Title is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:90:49
                     id="explanation"
                     type="text"
                     isInvalid={Boolean(errors.explanation)}
-                    {...register("explanation", {
-                        required: "Explanation is required.",
-                        maxLength : {
-                            value: 100,
-                            message: "Max length 100 characters"
-                        }
-                    })}
+                    {...register("explanation", {})}
                 />
                 <Form.Control.Feedback type="invalid">
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Explanation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:92:37
                     isInvalid={Boolean(errors.explanation)}
                     {...register("explanation", {
                         required: "Explanation is required.",
-                        maxLength : {
-                            value: 100,
-                            message: "Max length 100 characters"
-                        }
+                        maxLength : {}
                     })}
                 />
statusReason: Error: Unable to find an element with the text: /Max length 100 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:133:22
                     {...register("localDateTime", { required: true, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.localDateTime && 'LocalDateTime is required. '}
+                    {false}
                 </Form.Control.Feedback>
             </Form.Group>
statusReason: TestingLibraryElementError: Unable to find an element with the text: /LocalDateTime is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
