[Survived] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:50:37
                     isInvalid={Boolean(errors.orgTranslation)}
                     {...register("orgTranslation", {
                         required: "OrgTranslation is required.",
-                        maxLength : {
-                            value: 50,
-                            message: "Max length 30 characters"
-                        }
+                        maxLength : {}
                     })}
                 />

[Survived] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:52:38
                         required: "OrgTranslation is required.",
                         maxLength : {
                             value: 50,
-                            message: "Max length 30 characters"
+                            message: ""
                         }
                     })}
