[Survived] Regex
main/components/Articles/ArticlesForm.js:21:25
     const navigate = useNavigate();
 
     const isodate_regex = /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
-    const email_regex = /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/;
+    const email_regex = /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]\.[a-zA-Z]{2,}$/;
 
     const testIdPrefix = "ArticlesForm";

[Survived] Regex
main/components/Articles/ArticlesForm.js:21:25
     const navigate = useNavigate();
 
     const isodate_regex = /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
-    const email_regex = /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/;
+    const email_regex = /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}/;
 
     const testIdPrefix = "ArticlesForm";

[Killed] BooleanLiteral
main/components/Articles/ArticlesForm.js:110:55
                     id="email"
                     type="text"
                     isInvalid={Boolean(errors.email)}
-                    {...register("email", { required: true, pattern: email_regex })}
+                    {...register("email", { required: false, pattern: email_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:110:34
                     id="email"
                     type="text"
                     isInvalid={Boolean(errors.email)}
-                    {...register("email", { required: true, pattern: email_regex })}
+                    {...register("", { required: true, pattern: email_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
