[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:32:40
                         type="text"
                         isInvalid={Boolean(errors.orgCode)}
                         {...register("orgCode",
-                            {required: "orgCode is required."
+                            {required: ""
                         })}  
                     />
killedBy: UCSBOrganizationForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /orgCode is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:64:57
                     id="orgTranslationShort"
                     type="text"
                     isInvalid={Boolean(errors.orgTranslationShort)}
-                    {...register("orgTranslationShort", {
-                        required: "OrgTranslationShort is required."
-                    })}
+                    {...register("orgTranslationShort", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /OrgTranslationShort is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
