[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:32:21
 
     const columns = [
         {
-            Header: 'OrgCode',
+            Header: "",
             accessor: 'orgCode', // accessor is the "key" in the data
         },
killedBy: UserTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: OrgCode. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:33:23
     const columns = [
         {
             Header: 'OrgCode',
-            accessor: 'orgCode', // accessor is the "key" in the data
+            accessor: "", // accessor is the "key" in the data
         },
         {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgCode"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
