[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:9:31
 
 export default function UCSBOrganizationCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (ucsbOrganization) => ({
-    url: "/api/ucsborganizations/post",
-    method: "POST",
-    params: {
-        orgCode: ucsbOrganization.orgCode,
-        orgTranslationShort: ucsbOrganization.orgTranslationShort,
-        orgTranslation: ucsbOrganization.orgTranslation, 
-        inactive: ucsbOrganization.inactive
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbOrganization) => {
killedBy: UCSBOrganizationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:12:13
   const objectToAxiosParams = (ucsbOrganization) => ({
     url: "/api/ucsborganizations/post",
     method: "POST",
-    params: {
-        orgCode: ucsbOrganization.orgCode,
-        orgTranslationShort: ucsbOrganization.orgTranslationShort,
-        orgTranslation: ucsbOrganization.orgTranslation, 
-        inactive: ucsbOrganization.inactive
-    }
+    params: {}
   });
 
killedBy: UCSBOrganizationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "inactive": "true",
-   "orgCode": "1",

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:20:43
     }
   });
 
-  const onSuccess = (ucsbOrganization) => {
-    toast(`New ucsbOrganization Created - orgCode: ${ucsbOrganization.orgCode}`);
-  }
+  const onSuccess = (ucsbOrganization) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New ucsbOrganization Created - orgCode: 1"

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:21:11
   });
 
   const onSuccess = (ucsbOrganization) => {
-    toast(`New ucsbOrganization Created - orgCode: ${ucsbOrganization.orgCode}`);
+    toast(``);
   }
 
killedBy: UCSBOrganizationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New ucsbOrganization Created - orgCode: 1"
Received: ""

Number of calls: 1
